{
  "semantics": [
    {
      "label": "มีด้านสื่อ",
      "fields": [
        {
          "label": "ประเภท",
          "description": "สื่อที่เพิ่มเติมที่จะแสดงด้านบนของคำถาม (ไม่บังคับ)"
        },
        {
          "label": "ปิดฟังก์ชันซูมรูปภาพ"
        }
      ]
    },
    {
      "label": "คำอธิบายงาน",
      "description": "อธิบายวิธีการแก้ปัญหาที่ผู้ใช้ควรทำ",
      "default": "ลากคำใส่กล่องที่ถูกต้อง"
    },
    {
      "label": "ข้อความ",
      "placeholder": "*ออสโล* เป็นเมืองหลวงของประเทศนอร์เวย์, *สต็อกโฮล์ม* เป็นเมืองหลวงของประเทศสวีเดนและ *โคเปนเฮเกิน* เป็นเมืองหลวงของประเทศเดนมาร์ก ทั้งสามเมืองตั้งอยู่ในคาบสมุทรสกาฟเมืองในภูมิภาค *สแกนดิเนเวีย:ส่วนเหนือของยุโรป*",
      "important": {
        "description": "<ul><li>คำที่สามารถวางได้จะมีเครื่องหมายดอกจัน (*) อยู่ด้านหน้าและด้านหลังของคำ/วลีที่ถูกต้อง</li><li>คุณสามารถเพิ่มเคล็ดลับในรูปข้อความโดยใช้เครื่องหมายคอลอน (:) ด้านหน้าข้อความ</li><li>สำหรับทุกช่องว่าง จะมีคำตอบที่ถูกต้องเพียงคำเดียว</li><li>คุณสามารถเพิ่มข้อความตอบกลับที่จะแสดงเมื่อภารกิจเสร็จสิ้น ใช้ '\\+' สำหรับข้อความที่ถูกต้องและ '\\-' สำหรับข้อความที่ไม่ถูกต้อง</li

></ul>",
        "example": "เนื้อหา H5P สามารถแก้ไขได้โดยใช้ *เบราว์เซอร์:โปรแกรมประเภทใดคือ Chrome?* <br /> เนื้อหา H5P เป็น *แบบโต้ตอบ\\+ถูกต้องแล้ว! \\-ไม่ถูกต้อง ลองอีกครั้ง!*"
      }
    },
    {
      "label": "ข้อเสนอแนะทั่วไป",
      "fields": [
        {
          "widgets": [
            {
              "label": "ค่าเริ่มต้น"
            }
          ],
          "label": "กำหนดข้อเสนอแนะแบบกำหนดช่วงคะแนนเอง",
          "description": "คลิกปุ่ม \"เพิ่มช่วง\" เพื่อเพิ่มช่วงที่ต้องการ ตัวอย่าง: 0-20% คะแนนแย่, 21-91% คะแนนปานกลาง, 91-100% คะแนนดีมาก!",
          "entity": "ช่วง",
          "field": {
            "fields": [
              {
                "label": "ช่วงคะแนน"
              },
              {},
              {
                "label": "ข้อเสนอแนะสำหรับช่วงคะแนนที่กำหนด",
                "placeholder": "กรอกข้อเสนอแนะ"
              }
            ]
          }
        }
      ]
    },
    {
      "label": "ข้อความสำหรับปุ่ม \"ตรวจสอบ\"",
      "default": "ตรวจสอบ"
    },
    {
      "label": "ข้อความสำหรับปุ่ม \"ส่ง\"",
      "default": "ส่ง"
    },
    {
      "label": "ข้อความสำหรับปุ่ม \"ลองใหม่\"",
      "default": "ลองใหม่"
    },
    {
      "label": "ข้อความสำหรับปุ่ม \"แสดงคำตอบ\"",
      "default": "แสดงคำตอบ"
    },
    {
      "label": "ป้ายกำกับโซนที่มีหมายเลข",
      "default": "โซนที่ถูกวาง @index.",
      "description": "ป้ายกำกับที่ใช้เพื่อการเข้าถึง เมื่อเครื่องอ่านออกเสียงจะอ่านหมายเลขของโซนที่ถูกวาง ตัวแปร

ที่ใช้ได้: @index"
    },
    {
      "label": "ป้ายกำกับโซนที่ว่างเปล่า",
      "default": "โซนที่ถูกวาง @index ว่างเปล่า.",
      "description": "ป้ายกำกับที่ใช้เพื่อการเข้าถึง เมื่อเครื่องอ่านออกเสียงจะอ่านว่าโซนว่างเปล่า"
    },
    {
      "label": "ป้ายกำกับโซนที่มีข้อมูล",
      "default": "โซนที่ถูกวาง @index มีข้อมูล @draggable.",
      "description": "ป้ายกำกับที่ใช้เพื่อการเข้าถึง เมื่อเครื่องอ่านออกเสียงจะอ่านว่าโซนที่ถูกวางมีวัตถุที่สามารถลากได้"
    },
    {
      "label": "ป้ายกำกับองค์ประกอบที่ลากได้",
      "default": "@index จาก @count องค์ประกอบที่ลากได้.",
      "description": "ป้ายกำกับที่ใช้เพื่อการเข้าถึง เมื่อเครื่องอ่านออกเสียงจะอ่านว่านี่คือองค์ประกอบที่ลากได้ ตัวแปรที่ใช้ได้: @index, @count"
    },
    {
      "label": "ป้ายกำกับสำหรับปุ่มแสดงเคล็ดลับ",
      "default": "แสดงเคล็ดลับ",
      "description": "ป้ายกำกับที่ใช้เพื่อการเข้าถึง เมื่อเครื่องอ่านออกเสียงจะอ่านก่อนที่จะอ่านเคล็ดลับ"
    },
    {
      "label": "ข้อความที่อ่านโดยเครื่องอ่านออกเสียงสำหรับคำตอบที่ถูกต้อง",
      "default": "ถูกต้อง!"
    },
    {
      "label": "ข้อความที่อ่านโดยเครื่องอ่านออกเสียงสำหรับคำตอบที่ไม่ถูกต้อง",
      "default": "ไม่ถูกต้อง!"
    },
    {
      "label": "หัวข้อสำหรับกล่องที่มีข้อเสนอแนะ

",
      "default": "ข้อเสนอแนะ"
    },
    {
      "label": "รายการปล่อยลากที่มีข้อเสนอแนะ",
      "default": "รายการปล่อยลากที่มีข้อเสนอแนะ"
    },
    {
      "label": "ช่วงคะแนน",
      "default": "ช่วงคะแนน"
    },
    {
      "label": "ข้อความที่อ่านโดยเครื่องอ่านออกเสียงสำหรับช่วงคะแนนที่กำหนด",
      "default": "ช่วงคะแนน"
    },
    {
      "label": "ช่วงคะแนนที่กำหนด",
      "default": "ช่วงคะแนนที่กำหนด"
    },
    {
      "label": "ข้อความที่อ่านโดยเครื่องอ่านออกเสียงสำหรับปุ่ม \"ตรวจสอบ\"",
      "default": "ตรวจสอบ"
    },
    {
      "label": "ข้อความที่อ่านโดยเครื่องอ่านออกเสียงสำหรับปุ่ม \"ส่ง\"",
      "default": "ส่ง"
    },
    {
      "label": "ข้อความที่อ่านโดยเครื่องอ่านออกเสียงสำหรับปุ่ม \"ลองใหม่\"",
      "default": "ลองใหม่"
    },
    {
      "label": "ข้อความที่อ่านโดยเครื่องอ่านออกเสียงสำหรับปุ่ม \"แสดงคำตอบ\"",
      "default": "แสดงคำตอบ"
    }
  ]
}
